<template>
     <q-page class="flex flex-center q-pa-md">
      <h3>О Мир 1Т</h3>
      <p class="q-pa-md">Метавселенная 1Т представляет собой виртуальную среду для игры и разработки с разнообразными мирами, играми, внутренней экономикой, социальным элементом и наполнением. Социальность играет важную роль в концепции Метавселенной и заключается в совместных направленных и регулярной деятельности пользователей для поддержания жизнеспособности игрового мира. Создание космических колоний, городов, добыча и обмен ресурсами и торговля. </p>
      <p class="q-pa-md">Часть из этих игровых элементов будет иметь коммерческую составляющую. Можно владеть территорией и продавать её в полное пользование, планируется создание игровой валюты Метавселенной. Предполагается использование Искусственного интеллекта, который будет применяться для генерации изображений, текста и перевода. При помощи ИИ также можно генерировать предметы, текстуры, объекты, эффекты, персонажи и локации. На следующих этапах предполагается обучение нейросети на всех созданных моделях, персонажах, предметах, объектах, локациях и правил для генерации Метавселенной. На ранних этапах ИИ используется для генерации картинок и концептов для создания игр.</p>
    </q-page>
</template>
<script></script>