<template>
  <q-page class="flex flex-center q-pa-lg">
    <h3>О курсах</h3>
    <p>
      В рамках реализации проекта “Мир 1Т” предполагается создание Метавселенной
      и игр для привлечения клиентов на курсы. Также планируется создание
      обучающей платформы для детей, где учащиеся смогут освоить навыки
      гем-дизайна: создавать модели, уникальных персонажей, локации и создавать
      собственные игры совместно с преподавателями курсов. После окончания
      курсов обучающиеся проходят аттестацию с присвоением диплома.  В рамках
      реализации проекта “Мир 1Т” предполагается создание Метавселенной и игр
      для привлечения клиентов на курсы. Также планируется создание обучающей
      платформы для детей, где учащиеся смогут освоить навыки гем-дизайна:
      создавать модели, уникальных персонажей, локации и создавать собственные
      игры совместно с преподавателями курсов. После окончания курсов
      обучающиеся проходят аттестацию с присвоением диплома.  В рамках
      реализации проекта “Мир 1Т” предполагается создание Метавселенной и игр
      для привлечения клиентов на курсы. Также планируется создание обучающей
      платформы для детей, где учащиеся смогут освоить навыки гем-дизайна:
      создавать модели, уникальных персонажей, локации и создавать собственные
      игры совместно с преподавателями курсов. После окончания курсов
      обучающиеся проходят аттестацию с присвоением диплома. 
    </p>
    <q-btn label="Записаться" />

    <p>
      В рамках реализации проекта “Мир 1Т” предполагается создание Метавселенной
      и игр для привлечения клиентов на курсы. Также планируется создание
      обучающей платформы для детей, где учащиеся смогут освоить навыки
      гем-дизайна: создавать модели, уникальных персонажей, локации и создавать
      собственные игры совместно с преподавателями курсов. После окончания
      курсов обучающиеся проходят аттестацию с присвоением диплома.  В рамках
      реализации проекта “Мир 1Т” предполагается создание Метавселенной и игр
      для привлечения клиентов на курсы. Также планируется создание обучающей
      платформы для детей, где учащиеся смогут освоить навыки гем-дизайна:
      создавать модели, уникальных персонажей, локации и создавать собственные
      игры совместно с преподавателями курсов. После окончания курсов
      обучающиеся проходят аттестацию с присвоением диплома.  В рамках
      реализации проекта “Мир 1Т” предполагается создание Метавселенной и игр
      для привлечения клиентов на курсы.
    </p>
  </q-page>
</template>
<script></script>
