<template>
    <q-page class="flex flex-center q-pa-lg">
    <div v-if="!userAuth">
        <p>Вы не вошли в систему</p>
        <q-btn
            label="Вход"
            to="/login"
            />
    </div>
    <div v-if="userAuth">
        Определение
Редактор игр Мир 1Т представляет собой  инструмент для создания игр, в котором можно добавлять объекты на сцену, добавлять свет, камеры и размещать их в игровом пространстве, меняя характеристики объектов по необходимости. Редактор состоит из элементов (GUI окна взаимодействия редактора и др.).
Определение
Редактор игр Мир 1Т представляет собой  инструмент для создания игр, в котором можно добавлять объекты на сцену, добавлять свет, камеры и размещать их в игровом пространстве, меняя характеристики объектов по необходимости. Редактор состоит из элементов (GUI окна взаимодействия редактора и др.).
Редактор игр Мир 1Т представляет собой  инструмент для создания игр, в котором можно добавлять объекты на сцену, добавлять свет, камеры и размещать их в игровом пространстве, меняя характеристики объектов по необходимости. Редактор состоит из элементов (GUI окна взаимодействия редактора и др.).
    </div>
    </q-page>
</template>

<script>

import { defineComponent } from 'vue'

export default defineComponent({
  name: 'Editor',
 
  
  computed: {
    userAuth() {
      const token = localStorage.getItem('token')
      return Boolean(token)
    }
},

 
  
})
</script>

