<template>
  <q-page class="flex flex-center q-pa-lg">
    <div v-if="!userAuth">
      <p>Вы не вошли в систему</p>
      <q-btn label="Вход" to="/login" />
    </div>
    <div v-if="userAuth">
      <h3>Играть в Супер Шутер</h3>
      <p>
        Игра жанра шутер, где игроки сражаются в режиме “Все против всех”,
        побеждает тот, кто наберёт больше всего очков убийств. Шаблон игры
        предлагается к использованию для обучения учеников: можно редактировать
        карты, создавать новые карты (уровни), редактировать/кастомизировать и
        создавать новое оружие, изменять/создавать анимации, объекты и их
        свойства. 
      </p>
      <h3>Хоррор</h3>
      <p>
        Командная игра, хоррор-квест-головоломка на выживание, с генерируемыми
        картами, один из игроков убийца/монстр, который охотится на команду.
        Команда должна выполнять задания, собирать предметы, решать головоломки
        чтобы выбраться с карты. Если вся команда ликвидирована, то побеждает
        убийца, если часть команды выбралась с карты, то побеждает команда.
      </p>
      <h3>Платформер</h3>
      <p>
        Командная или одиночная игра, карта одна, но генерируются разные
        проходы. Одни двери открыты, другие закрыты. Цель игры добежать до
        финиша за время. Механики паркура Препятствия и ловушки в пещере, в
        лагере разбойников и храме. Система чекпоинтов - погибший возрождается
        на следующем чекпоинте что задел напарник. Когда все мертвы - игра
        проиграна. Разные биомы и условия.
      </p>
      <h3>Гонки</h3>
      <p>
        Необычная интерпретация классического понимания жанра, предлагается
        комбинировать жанры и элементы, например, гонка-выживание со стрельбой.
        Можно создать классические варианты гонок с трассами, где побеждает
        первый, кто прибыл к финишу.
      </p>
    </div>
  </q-page>
</template>
<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "Play",

  computed: {
    userAuth() {
      const token = localStorage.getItem("token");
      return Boolean(token);
    },
  },
});
</script>
